app/Controllers/LoginController.php

    public function doLogin()
    {
        $email = $this->request->getVar('email');
        $password = $this->request->getVar('password');
        $session = session();

        $model = new \App\Models\UserModel();
        $user = $model->where('email', $email)->first();
---
SELECT *
FROM `users`
WHERE `email` = 'anfal@gmail.com'
 LIMIT 1